In [2]:
people = {
    "first": ["Onkar",'Rohan','Shritej'],
    "Second": ["Galande",'Galande','Kumbhar'],
    "Email": ["galandeonkar2001@gmail.com",'rohangalande@gmail.com','kumbharshritya@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1    Rohan  Galande      rohangalande@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [7]:
df['Second'] == 'Galande'

0     True
1     True
2    False
Name: Second, dtype: bool

In [8]:
filt = (df['Second'] == 'Galande')

In [10]:
df[filt]

   first   Second                       Email
0  Onkar  Galande  galandeonkar2001@gmail.com
1  Rohan  Galande      rohangalande@gmail.com

In [11]:
df.loc[filt]

   first   Second                       Email
0  Onkar  Galande  galandeonkar2001@gmail.com
1  Rohan  Galande      rohangalande@gmail.com

In [12]:
df.loc[filt, 'Email']

0    galandeonkar2001@gmail.com
1        rohangalande@gmail.com
Name: Email, dtype: object

In [13]:
# CONDITIONOL OPERATORS

#  & = And
#  | = Or

In [14]:
filt = (df['Second'] == 'Galande') & (df['first'] == 'Onkar')

In [15]:
df.loc[filt, 'Email']

0    galandeonkar2001@gmail.com
Name: Email, dtype: object

In [16]:
filt = (df['Second'] == 'Galande') | (df['first'] == 'Rohan')

In [17]:
df.loc[filt, 'Email']

0    galandeonkar2001@gmail.com
1        rohangalande@gmail.com
Name: Email, dtype: object

In [18]:
filt = (df['Second'] == 'Galande') | (df['first'] == 'Shritej')

In [20]:
df.loc[~filt,'Email']

2    kumbharshritya@gmail.com
Name: Email, dtype: object